In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [5]:
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [6]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [7]:
# We can change column names also
df.columns = ['first_name', 'last_name', 'email']
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [8]:
df.columns = [x.title() for x in df.columns]
df

  First_Name Last_Name                    Email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [9]:
# If we only want to rename certain columns
df.rename(columns = {'First_Name' : 'first', 'Last_Name' : 'last'}, inplace = True)
df

   first     last                    Email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [10]:
# we can even change rows also
df.loc[2] = ['Pavan', 'Kalyan', 'pavankalyan@gmail.com']
df

   first     last                    Email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2  Pavan   Kalyan    pavankalyan@gmail.com

In [11]:
# If we only want to change certain values same as accessing it, instead of accessing it , we can change it
df.loc[2, 'last'] = 'Reddy'
df

   first     last                    Email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2  Pavan    Reddy    pavankalyan@gmail.com

In [14]:
# We can change every element in series data structure like this
df['Email'] = df['Email'].str.lower()
df

   first     last                    Email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2  Pavan    Reddy    pavankalyan@gmail.com

In [15]:
# If we want to know the length of each email
len(df['Email'])

3

In [17]:
# Above gives no.of elements in series 
# we can use apply function to apply it for each and every element in series
df['Email'].apply(len)

0    23
1    17
2    21
Name: Email, dtype: int64

In [18]:
# we can even apply our own functions also
def update_email(email):
    return email.upper()
df['Email'] = df['Email'].apply(update_email)
df

   first     last                    Email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2  Pavan    Reddy    PAVANKALYAN@GMAIL.COM

In [19]:
df['Email'] = df['Email'].apply(lambda x: x.lower())

In [20]:
df

   first     last                    Email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2  Pavan    Reddy    pavankalyan@gmail.com

In [23]:
# we can even use apply function for entire dataframe, then it will apply the function for each column and gives us aggregate values
df.apply(len)

first    3
last     3
Email    3
dtype: int64

In [29]:
# If we want to apply a function to each and every element then use applymap function
df.applymap(len)

C:\Users\gpava\AppData\Local\Temp\ipykernel_2696\2063356372.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   first  last  Email
0      5     7     23
1      4     3     17
2      5     5     21

In [30]:
df.applymap(lambda x: x.lower())

C:\Users\gpava\AppData\Local\Temp\ipykernel_2696\585638944.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: x.lower())

   first     last                    Email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2  pavan    reddy    pavankalyan@gmail.com

In [37]:
# we can even change a respective column values as follows
df['first'].map({'Corey' : 'pk'})

0     pk
1    NaN
2    NaN
Name: first, dtype: object

In [38]:
# map function if not specifies gives null values for others, if we want o just replace and keep unchanged as same use replace function
df['first'] = df['first'].replace({'corey' : 'pk'})

In [39]:
df

   first     last                    Email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2  Pavan    Reddy    pavankalyan@gmail.com